modules/models/Admin.php

SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = 'e10adc3949ba59abbe56e057f20f883e'
---
    public function validatePass()
    {
        if(!$this->hasErrors()){
            $data=self::find()->where('adminuser = :user and adminpass = :pass',['user'=>$this->adminuser,'pass'=> md5($this->adminpass)])->one();

UPDATE `shop_admin` SET `logintime`=1481035070, `loginip`=3232243969 WHERE adminuser = 'admin'
---
    public function login($data)
    {
        $this->scenario='login';
        if($this->load($data) && $this->validate()){
            $lifetime=$this->rememberMe ? 24*3600 : 24*3600;
            $session = Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['admin']=[
                'adminuser'=>$this->adminuser,
                'isLogin'=> 1,
            ];

            /*$this->adminuser的值由load($data)后产生*/
            $this->updateAll(['logintime'=>time(),'loginip'=> ip2long(Yii::$app->request->userIP)],'adminuser = :user',[':user'=>$this->adminuser]);

UPDATE `shop_admin` SET `adminpass`='e10adc3949ba59abbe56e057f20f883e' WHERE adminuser='admin'
---
    public function changePass($data)
    {
        $this->scenario='changepass';
        if($this->load($data) && $this->validate()){
            return (bool)$this->updateAll(['adminpass'=>md5($this->adminpass)],'adminuser=:user',[':user'=>$this->adminuser]);

INSERT INTO `shop_admin` (`adminuser`, `adminemail`, `adminpass`, `createtime`) VALUES ('bbb', 'bbb@qq.com', 'e10adc3949ba59abbe56e057f20f883e', 1488198602)
---
    public function reg($data)
    {
        $this->scenario='adminadd';
        if($this->load($data)&&$this->validate()){
            // load数据后，$this->adminpass 等价于 ￥data['Admin']['adminpass]
            $this->adminpass = md5($this->adminpass);
            //还要保存创建时间 save给了false就不会验证
            $this->createtime = time();
            if($this->save(false)){