modules/models/Admin.php

SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = '202cb962ac59075b964b07152d234b70'
---
    public function validatePass()
    {
        if(!$this->hasErrors()){
            $data=self::find()->where('adminuser = :user and adminpass = :pass',['user'=>$this->adminuser,'pass'=> md5($this->adminpass)])->one();

UPDATE `shop_admin` SET `logintime`=1479829802, `loginip`=3232243969 WHERE adminuser = 'admin'
---
    public function login($data)
    {
        if($this->load($data) && $this->validate()){
            $lifetime=$this->rememberMe ? 24*3600 : 0;
            $session = Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['admin']=[
                'adminuser'=>$this->adminuser,
                'isLogin'=> 1,
            ];
            $this->updateAll(['logintime'=>time(),'loginip'=> ip2long(Yii::$app->request->userIP)],'adminuser = :user',[':user'=>$this->adminuser]);