modules/controllers/ManageController.php

SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 10
---
    public function actionManagers()
    {
        $this->layout = "layout1";
        $model=Admin::find();
        $count=$model->count();
        $pageSize=Yii::$app->params['pageSize']['manage'];
        $pager=new Pagination(['totalCount'=>$count,'pageSize'=>$pageSize]);
        $managers=$model->offset($pager->offset)->limit($pager->limit)->all();

DELETE FROM `shop_admin` WHERE adminid=13
---
    public function actionDel()
    {
        $adminid = (int)Yii::$app->request->get('adminid');
        if(empty($adminid)){
            $this->redirect(['manage/managers']);
        }
        $model=new Admin;
        if($model->deleteAll('adminid=:id',[':id'=>$adminid])){

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
    public function actionChangeemail()
    {
        $this->layout='layout1';
        $model= Admin::find()->where('adminuser = :user',[':user'=>Yii::$app->session['admin']['adminuser']])->one();

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
    public function actionChangepass()
    {
        $this->layout='layout1';
        $model=Admin::find()->where('adminuser = :user',[':user'=> Yii::$app->session['admin']['adminuser']])->one();