controllers/MemberController.php

    public function actionQqcallback()
    {
        require_once("../vendor/qqlogin/qqConnectAPI.php");
        $auth = new \OAuth();
        $accessToken = $auth->qq_callback();
        $openid = $auth->get_openid();
        $qc = new \QC($accessToken, $openid);
        $userinfo = $qc->get_user_info();
        //var_dump($userinfo);exit;
        $session = Yii::$app->session;
        $session['userinfo'] = $userinfo;
        $session['openid'] = $openid;
        // 判断openid是否存在与User表中
        if ($model = User::find()->where('openid = :openid', [':openid' => $openid])->one()) {
---
SELECT * FROM `shop_user` WHERE openid = '0462BAF6A4CD163048ED57EAD7FAA23B'