controllers/ProductController.php

SELECT * FROM `shop_product` WHERE cateid = '4' and ison = '1'
SELECT COUNT(*) FROM `shop_product` WHERE cateid = '4' and ison = '1'
SELECT * FROM `shop_product` WHERE cateid = '4' and ison = '1' LIMIT 9
SELECT * FROM `shop_product` WHERE cateid = '4' and ison = '1' and istui = '1' ORDER BY `createtime` DESC LIMIT 5
SELECT * FROM `shop_product` WHERE cateid = '4' and ison = '1' and ishot = '1' ORDER BY `createtime` DESC LIMIT 5
SELECT * FROM `shop_product` WHERE cateid = '4' and ison = '1' and issale = '1' ORDER BY `createtime` DESC LIMIT 5
---
    public function actionIndex()
    {
        $this->layout = "layout2";
        $cid = Yii::$app->request->get("cateid");
        $where = "cateid = :cid and ison = '1'";
        $params = [':cid' => $cid];
        $model = Product::find()->where($where, $params);
        $all = $model->asArray()->all();

        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['frontproduct'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $all = $model->offset($pager->offset)->limit($pager->limit)->asArray()->all();

        $tui = $model->Where($where . ' and istui = \'1\'', $params)->orderby('createtime desc')->limit(5)->asArray()->all();
        $hot = $model->Where($where . ' and ishot = \'1\'', $params)->orderby('createtime desc')->limit(5)->asArray()->all();
        $sale = $model->Where($where . ' and issale = \'1\'', $params)->orderby('createtime desc')->limit(5)->asArray()->all();

SELECT * FROM `shop_product` WHERE productid = '17'
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 7
---
    public function actionDetail()
    {
        $this->layout = "layout2";
        $productid = Yii::$app->request->get("productid");
        $product = Product::find()->where('productid = :id', [':id' => $productid])->asArray()->one();
        $data['all'] = Product::find()->where('ison = "1"')->orderby('createtime desc')->limit(7)->all();