models/Pay.php

SELECT * FROM `shop_order` WHERE orderid = '49'
SELECT * FROM `shop_order_detail` WHERE orderid = '49'
SELECT * FROM `shop_product` WHERE productid = '15'
---
    public static function alipay($orderid)
    {
        $amount = Order::find()->where('orderid = :oid', [':oid' => $orderid])->one()->amount;
        if (!empty($amount)) {
            $alipay = new \AlipayPay();
            $giftname = "京东商城";
            $data = OrderDetail::find()->where('orderid = :oid', [':oid' => $orderid])->all();
            $body = "";
            foreach($data as $pro) {
                $body .= Product::find()->where('productid = :pid', [':pid' => $pro['productid']])->one()->title . " - ";