models/Product.php

INSERT INTO `shop_product` (`cateid`, `title`, `descr`, `price`, `ishot`, `issale`, `saleprice`, `num`, `istui`, `cover`, `pics`) VALUES ('1', '牛仔裤', '牛仔裤 男 28-35码 厚度正常 春夏', '88', '1', '1', '83', 666, '1', 'omararqey.bkt.clouddn.com/58bae48ec98f7', '{\"58bae48ee9bfa\":\"omararqey.bkt.clouddn.com\\/58bae48ee9bfa\"}')
---
    public function add($data)
    {
        if ($this->load($data) && $this->save()) {